# Libraries

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
from platform import python_version

print(f'python_version: {python_version()}')
print(f'pandas: {pd.__version__}')
print(f'numpy: {np.__version__}')
print(f'seaborn: {sns.__version__}')

# Data

In [2]:
app_data = pd.read_csv('application_record.csv')
cre_data = pd.read_csv('credit_record.csv')
app_data.shape, cre_data.shape

((438557, 18), (1048575, 3))

In [3]:
app_data.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [4]:
cre_data.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

__checking missing values__

In [22]:
app_data.isna().sum()

ID                          0
CODE_GENDER                 0
FLAG_OWN_CAR                0
FLAG_OWN_REALTY             0
CNT_CHILDREN                0
AMT_INCOME_TOTAL            0
NAME_INCOME_TYPE            0
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE           0
DAYS_BIRTH                  0
DAYS_EMPLOYED               0
FLAG_MOBIL                  0
FLAG_WORK_PHONE             0
FLAG_PHONE                  0
FLAG_EMAIL                  0
OCCUPATION_TYPE        134203
CNT_FAM_MEMBERS             0
dtype: int64

In [23]:
cre_data.isna().sum()

ID                0
MONTHS_BALANCE    0
STATUS            0
dtype: int64

__checking datatypes__

In [5]:
app_data.dtypes

ID                       int64
CODE_GENDER             object
FLAG_OWN_CAR            object
FLAG_OWN_REALTY         object
CNT_CHILDREN             int64
AMT_INCOME_TOTAL       float64
NAME_INCOME_TYPE        object
NAME_EDUCATION_TYPE     object
NAME_FAMILY_STATUS      object
NAME_HOUSING_TYPE       object
DAYS_BIRTH               int64
DAYS_EMPLOYED            int64
FLAG_MOBIL               int64
FLAG_WORK_PHONE          int64
FLAG_PHONE               int64
FLAG_EMAIL               int64
OCCUPATION_TYPE         object
CNT_FAM_MEMBERS        float64
dtype: object

In [6]:
cre_data.dtypes

ID                 int64
MONTHS_BALANCE     int64
STATUS            object
dtype: object

__checking percentage of duplicates in both datasets__

In [7]:
print(
    f"Duplicates in applications df: {app_data.iloc[:,1:].duplicated().sum()}, ({np.round(100 * app_data.iloc[:,1:].duplicated().sum()/len(app_data),1)}%)"
)
print()
print(
    f"Duplicates in credit_record df: {cre_data.duplicated().sum()}, ({np.round(100 * cre_data.duplicated().sum()/len(app_data),1)}%)"
)

Duplicates in applications df: 348472, (79.5%)

Duplicates in record df: 0, (0.0%)

__Checking Cardinality of features__

In [17]:
app_data.nunique()

ID                     438510
CODE_GENDER                 2
FLAG_OWN_CAR                2
FLAG_OWN_REALTY             2
CNT_CHILDREN               12
AMT_INCOME_TOTAL          866
NAME_INCOME_TYPE            5
NAME_EDUCATION_TYPE         5
NAME_FAMILY_STATUS          5
NAME_HOUSING_TYPE           6
DAYS_BIRTH              16379
DAYS_EMPLOYED            9406
FLAG_MOBIL                  1
FLAG_WORK_PHONE             2
FLAG_PHONE                  2
FLAG_EMAIL                  2
OCCUPATION_TYPE            18
CNT_FAM_MEMBERS            13
dtype: int64

In [18]:
cre_data.nunique()

ID                45985
MONTHS_BALANCE       61
STATUS                8
dtype: int64

In [20]:
cre_data['STATUS'].unique()

array(['X', '0', 'C', '1', '2', '3', '4', '5'], dtype=object)

After checking the results returned from ```nunique``` method, I found out that 

__application_record__ has:
- 1 constant feature
- 3 continuous features
- 6 binary categorical features
- 3 non-binary categorical features

__credit_record__ has:
- 1 continuous feature
- 1 nonbinary categorical feature which is our target variable

# Data Cleaning

__droping duplicates__

In [27]:
print("shape before dropping duplicates:", app_data.shape)
app_data = app_data.drop_duplicates(subset=app_data.columns[1:], keep="first")
print("shape after dropping duplicates:", app_data.shape)

shape before dropping duplicates: (90085, 18)
shape after dropping duplicates: (90085, 18)

**fill missing values**